SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_veq.h
/**************************************************************************//**
 * @file
 * @brief EFR32FG25 VEQ register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32FG25_VEQ_H
#define EFR32FG25_VEQ_H
#define VEQ_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32FG25_VEQ VEQ
 * @{
 * @brief EFR32FG25 VEQ Register Declaration.
 *****************************************************************************/

/** VEQ Register Declaration. */
typedef struct {
  __IM uint32_t  IPVERSION;                     /**< IP Version ID                                      */
  __IOM uint32_t EN;                            /**< Module Enable                                      */
  __IOM uint32_t SWRST;                         /**< Software Reset                                     */
  __IOM uint32_t CONNECT;                       /**< New Register                                       */
  __IOM uint32_t DISCLK;                        /**< Disable Clocks                                     */
  uint32_t       RESERVED0[3U];                 /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN;                        /**< New Register                                       */
  uint32_t       RESERVED1[7U];                 /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT;                       /**< New Register                                       */
  uint32_t       RESERVED2[23U];                /**< Reserved for future use                            */
  uint32_t       RESERVED3[1U];                 /**< Reserved for future use                            */
  uint32_t       RESERVED4[7U];                 /**< Reserved for future use                            */
  __IOM uint32_t FMTOUT;                        /**< New Register                                       */
  uint32_t       RESERVED5[79U];                /**< Reserved for future use                            */
  __IOM uint32_t CFG;                           /**< VEQ Configuration                                  */
  uint32_t       RESERVED6[3U];                 /**< Reserved for future use                            */
  __IM uint32_t  STAT;                          /**< VEQ Status                                         */
  uint32_t       RESERVED7[3U];                 /**< Reserved for future use                            */
  __IOM uint32_t CTRL;                          /**< VEQ Control                                        */
  uint32_t       RESERVED8[887U];               /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_SET;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_SET;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_SET;                     /**< Software Reset                                     */
  __IOM uint32_t CONNECT_SET;                   /**< New Register                                       */
  __IOM uint32_t DISCLK_SET;                    /**< Disable Clocks                                     */
  uint32_t       RESERVED9[3U];                 /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN_SET;                    /**< New Register                                       */
  uint32_t       RESERVED10[7U];                /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT_SET;                   /**< New Register                                       */
  uint32_t       RESERVED11[23U];               /**< Reserved for future use                            */
  uint32_t       RESERVED12[1U];                /**< Reserved for future use                            */
  uint32_t       RESERVED13[7U];                /**< Reserved for future use                            */
  __IOM uint32_t FMTOUT_SET;                    /**< New Register                                       */
  uint32_t       RESERVED14[79U];               /**< Reserved for future use                            */
  __IOM uint32_t CFG_SET;                       /**< VEQ Configuration                                  */
  uint32_t       RESERVED15[3U];                /**< Reserved for future use                            */
  __IM uint32_t  STAT_SET;                      /**< VEQ Status                                         */
  uint32_t       RESERVED16[3U];                /**< Reserved for future use                            */
  __IOM uint32_t CTRL_SET;                      /**< VEQ Control                                        */
  uint32_t       RESERVED17[887U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_CLR;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_CLR;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_CLR;                     /**< Software Reset                                     */
  __IOM uint32_t CONNECT_CLR;                   /**< New Register                                       */
  __IOM uint32_t DISCLK_CLR;                    /**< Disable Clocks                                     */
  uint32_t       RESERVED18[3U];                /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN_CLR;                    /**< New Register                                       */
  uint32_t       RESERVED19[7U];                /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT_CLR;                   /**< New Register                                       */
  uint32_t       RESERVED20[23U];               /**< Reserved for future use                            */
  uint32_t       RESERVED21[1U];                /**< Reserved for future use                            */
  uint32_t       RESERVED22[7U];                /**< Reserved for future use                            */
  __IOM uint32_t FMTOUT_CLR;                    /**< New Register                                       */
  uint32_t       RESERVED23[79U];               /**< Reserved for future use                            */
  __IOM uint32_t CFG_CLR;                       /**< VEQ Configuration                                  */
  uint32_t       RESERVED24[3U];                /**< Reserved for future use                            */
  __IM uint32_t  STAT_CLR;                      /**< VEQ Status                                         */
  uint32_t       RESERVED25[3U];                /**< Reserved for future use                            */
  __IOM uint32_t CTRL_CLR;                      /**< VEQ Control                                        */
  uint32_t       RESERVED26[887U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_TGL;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_TGL;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_TGL;                     /**< Software Reset                                     */
  __IOM uint32_t CONNECT_TGL;                   /**< New Register                                       */
  __IOM uint32_t DISCLK_TGL;                    /**< Disable Clocks                                     */
  uint32_t       RESERVED27[3U];                /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN_TGL;                    /**< New Register                                       */
  uint32_t       RESERVED28[7U];                /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT_TGL;                   /**< New Register                                       */
  uint32_t       RESERVED29[23U];               /**< Reserved for future use                            */
  uint32_t       RESERVED30[1U];                /**< Reserved for future use                            */
  uint32_t       RESERVED31[7U];                /**< Reserved for future use                            */
  __IOM uint32_t FMTOUT_TGL;                    /**< New Register                                       */
  uint32_t       RESERVED32[79U];               /**< Reserved for future use                            */
  __IOM uint32_t CFG_TGL;                       /**< VEQ Configuration                                  */
  uint32_t       RESERVED33[3U];                /**< Reserved for future use                            */
  __IM uint32_t  STAT_TGL;                      /**< VEQ Status                                         */
  uint32_t       RESERVED34[3U];                /**< Reserved for future use                            */
  __IOM uint32_t CTRL_TGL;                      /**< VEQ Control                                        */
} VEQ_TypeDef;
/** @} End of group EFR32FG25_VEQ */

/**************************************************************************//**
 * @addtogroup EFR32FG25_VEQ
 * @{
 * @defgroup EFR32FG25_VEQ_BitFields VEQ Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for VEQ IPVERSION */
#define _VEQ_IPVERSION_RESETVALUE           0x00000001UL                                /**< Default value for VEQ_IPVERSION             */
#define _VEQ_IPVERSION_MASK                 0xFFFFFFFFUL                                /**< Mask for VEQ_IPVERSION                      */
#define _VEQ_IPVERSION_IPVERSION_SHIFT      0                                           /**< Shift value for VEQ_IPVERSION               */
#define _VEQ_IPVERSION_IPVERSION_MASK       0xFFFFFFFFUL                                /**< Bit mask for VEQ_IPVERSION                  */
#define _VEQ_IPVERSION_IPVERSION_DEFAULT    0x00000001UL                                /**< Mode DEFAULT for VEQ_IPVERSION              */
#define VEQ_IPVERSION_IPVERSION_DEFAULT     (_VEQ_IPVERSION_IPVERSION_DEFAULT << 0)     /**< Shifted mode DEFAULT for VEQ_IPVERSION      */

