SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_veq.h
/* Bit fields for VEQ EN */
#define _VEQ_EN_RESETVALUE                  0x00000000UL                                /**< Default value for VEQ_EN                    */
#define _VEQ_EN_MASK                        0x00000003UL                                /**< Mask for VEQ_EN                             */
#define VEQ_EN_EN                           (0x1UL << 0)                                /**< Module Enable                               */
#define _VEQ_EN_EN_SHIFT                    0                                           /**< Shift value for VEQ_EN                      */
#define _VEQ_EN_EN_MASK                     0x1UL                                       /**< Bit mask for VEQ_EN                         */
#define _VEQ_EN_EN_DEFAULT                  0x00000000UL                                /**< Mode DEFAULT for VEQ_EN                     */
#define VEQ_EN_EN_DEFAULT                   (_VEQ_EN_EN_DEFAULT << 0)                   /**< Shifted mode DEFAULT for VEQ_EN             */
#define VEQ_EN_DISABLING                    (0x1UL << 1)                                /**< Disablement Busy Status                     */
#define _VEQ_EN_DISABLING_SHIFT             1                                           /**< Shift value for VEQ_DISABLING               */
#define _VEQ_EN_DISABLING_MASK              0x2UL                                       /**< Bit mask for VEQ_DISABLING                  */
#define _VEQ_EN_DISABLING_DEFAULT           0x00000000UL                                /**< Mode DEFAULT for VEQ_EN                     */
#define VEQ_EN_DISABLING_DEFAULT            (_VEQ_EN_DISABLING_DEFAULT << 1)            /**< Shifted mode DEFAULT for VEQ_EN             */

/* Bit fields for VEQ SWRST */
#define _VEQ_SWRST_RESETVALUE               0x00000000UL                                /**< Default value for VEQ_SWRST                 */
#define _VEQ_SWRST_MASK                     0x00000003UL                                /**< Mask for VEQ_SWRST                          */
#define VEQ_SWRST_SWRST                     (0x1UL << 0)                                /**< Software Reset Command                      */
#define _VEQ_SWRST_SWRST_SHIFT              0                                           /**< Shift value for VEQ_SWRST                   */
#define _VEQ_SWRST_SWRST_MASK               0x1UL                                       /**< Bit mask for VEQ_SWRST                      */
#define _VEQ_SWRST_SWRST_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for VEQ_SWRST                  */
#define VEQ_SWRST_SWRST_DEFAULT             (_VEQ_SWRST_SWRST_DEFAULT << 0)             /**< Shifted mode DEFAULT for VEQ_SWRST          */
#define VEQ_SWRST_RESETTING                 (0x1UL << 1)                                /**< Software Reset Busy Status                  */
#define _VEQ_SWRST_RESETTING_SHIFT          1                                           /**< Shift value for VEQ_RESETTING               */
#define _VEQ_SWRST_RESETTING_MASK           0x2UL                                       /**< Bit mask for VEQ_RESETTING                  */
#define _VEQ_SWRST_RESETTING_DEFAULT        0x00000000UL                                /**< Mode DEFAULT for VEQ_SWRST                  */
#define VEQ_SWRST_RESETTING_DEFAULT         (_VEQ_SWRST_RESETTING_DEFAULT << 1)         /**< Shifted mode DEFAULT for VEQ_SWRST          */

/* Bit fields for VEQ CONNECT */
#define _VEQ_CONNECT_RESETVALUE             0x00000000UL                                /**< Default value for VEQ_CONNECT               */
#define _VEQ_CONNECT_MASK                   0x00000101UL                                /**< Mask for VEQ_CONNECT                        */
#define VEQ_CONNECT_IN                      (0x1UL << 0)                                /**< Input FIFO connect                          */
#define _VEQ_CONNECT_IN_SHIFT               0                                           /**< Shift value for VEQ_IN                      */
#define _VEQ_CONNECT_IN_MASK                0x1UL                                       /**< Bit mask for VEQ_IN                         */
#define _VEQ_CONNECT_IN_DEFAULT             0x00000000UL                                /**< Mode DEFAULT for VEQ_CONNECT                */
#define VEQ_CONNECT_IN_DEFAULT              (_VEQ_CONNECT_IN_DEFAULT << 0)              /**< Shifted mode DEFAULT for VEQ_CONNECT        */
#define VEQ_CONNECT_OUT                     (0x1UL << 8)                                /**< Output FIFO connect                         */
#define _VEQ_CONNECT_OUT_SHIFT              8                                           /**< Shift value for VEQ_OUT                     */
#define _VEQ_CONNECT_OUT_MASK               0x100UL                                     /**< Bit mask for VEQ_OUT                        */
#define _VEQ_CONNECT_OUT_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for VEQ_CONNECT                */
#define VEQ_CONNECT_OUT_DEFAULT             (_VEQ_CONNECT_OUT_DEFAULT << 8)             /**< Shifted mode DEFAULT for VEQ_CONNECT        */

/* Bit fields for VEQ DISCLK */
#define _VEQ_DISCLK_RESETVALUE              0x00000002UL                                /**< Default value for VEQ_DISCLK                */
#define _VEQ_DISCLK_MASK                    0x00000003UL                                /**< Mask for VEQ_DISCLK                         */
#define _VEQ_DISCLK_DISCLK_SHIFT            0                                           /**< Shift value for VEQ_DISCLK                  */
#define _VEQ_DISCLK_DISCLK_MASK             0x3UL                                       /**< Bit mask for VEQ_DISCLK                     */
#define _VEQ_DISCLK_DISCLK_DEFAULT          0x00000002UL                                /**< Mode DEFAULT for VEQ_DISCLK                 */
#define _VEQ_DISCLK_DISCLK_NONE             0x00000000UL                                /**< Mode NONE for VEQ_DISCLK                    */
#define _VEQ_DISCLK_DISCLK_ALL              0x00000001UL                                /**< Mode ALL for VEQ_DISCLK                     */
#define _VEQ_DISCLK_DISCLK_AUTO             0x00000002UL                                /**< Mode AUTO for VEQ_DISCLK                    */
#define VEQ_DISCLK_DISCLK_DEFAULT           (_VEQ_DISCLK_DISCLK_DEFAULT << 0)           /**< Shifted mode DEFAULT for VEQ_DISCLK         */
#define VEQ_DISCLK_DISCLK_NONE              (_VEQ_DISCLK_DISCLK_NONE << 0)              /**< Shifted mode NONE for VEQ_DISCLK            */
#define VEQ_DISCLK_DISCLK_ALL               (_VEQ_DISCLK_DISCLK_ALL << 0)               /**< Shifted mode ALL for VEQ_DISCLK             */
#define VEQ_DISCLK_DISCLK_AUTO              (_VEQ_DISCLK_DISCLK_AUTO << 0)              /**< Shifted mode AUTO for VEQ_DISCLK            */

