SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_veq.h
/* Bit fields for VEQ FIFOIN */
#define _VEQ_FIFOIN_RESETVALUE              0x00000000UL                                /**< Default value for VEQ_FIFOIN                */
#define _VEQ_FIFOIN_MASK                    0x1F033F0FUL                                /**< Mask for VEQ_FIFOIN                         */
#define _VEQ_FIFOIN_FID_SHIFT               0                                           /**< Shift value for VEQ_FID                     */
#define _VEQ_FIFOIN_FID_MASK                0xFUL                                       /**< Bit mask for VEQ_FID                        */
#define _VEQ_FIFOIN_FID_DEFAULT             0x00000000UL                                /**< Mode DEFAULT for VEQ_FIFOIN                 */
#define VEQ_FIFOIN_FID_DEFAULT              (_VEQ_FIFOIN_FID_DEFAULT << 0)              /**< Shifted mode DEFAULT for VEQ_FIFOIN         */
#define _VEQ_FIFOIN_CID_SHIFT               8                                           /**< Shift value for VEQ_CID                     */
#define _VEQ_FIFOIN_CID_MASK                0x3F00UL                                    /**< Bit mask for VEQ_CID                        */
#define _VEQ_FIFOIN_CID_DEFAULT             0x00000000UL                                /**< Mode DEFAULT for VEQ_FIFOIN                 */
#define VEQ_FIFOIN_CID_DEFAULT              (_VEQ_FIFOIN_CID_DEFAULT << 8)              /**< Shifted mode DEFAULT for VEQ_FIFOIN         */
#define _VEQ_FIFOIN_REM_SHIFT               16                                          /**< Shift value for VEQ_REM                     */
#define _VEQ_FIFOIN_REM_MASK                0x30000UL                                   /**< Bit mask for VEQ_REM                        */
#define _VEQ_FIFOIN_REM_DEFAULT             0x00000000UL                                /**< Mode DEFAULT for VEQ_FIFOIN                 */
#define VEQ_FIFOIN_REM_DEFAULT              (_VEQ_FIFOIN_REM_DEFAULT << 16)             /**< Shifted mode DEFAULT for VEQ_FIFOIN         */
#define _VEQ_FIFOIN_ALARM_SHIFT             24                                          /**< Shift value for VEQ_ALARM                   */
#define _VEQ_FIFOIN_ALARM_MASK              0x1F000000UL                                /**< Bit mask for VEQ_ALARM                      */
#define _VEQ_FIFOIN_ALARM_DEFAULT           0x00000000UL                                /**< Mode DEFAULT for VEQ_FIFOIN                 */
#define VEQ_FIFOIN_ALARM_DEFAULT            (_VEQ_FIFOIN_ALARM_DEFAULT << 24)           /**< Shifted mode DEFAULT for VEQ_FIFOIN         */

/* Bit fields for VEQ FIFOOUT */
#define _VEQ_FIFOOUT_RESETVALUE             0x00000000UL                                /**< Default value for VEQ_FIFOOUT               */
#define _VEQ_FIFOOUT_MASK                   0x1F030000UL                                /**< Mask for VEQ_FIFOOUT                        */
#define _VEQ_FIFOOUT_CNT_SHIFT              16                                          /**< Shift value for VEQ_CNT                     */
#define _VEQ_FIFOOUT_CNT_MASK               0x30000UL                                   /**< Bit mask for VEQ_CNT                        */
#define _VEQ_FIFOOUT_CNT_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for VEQ_FIFOOUT                */
#define VEQ_FIFOOUT_CNT_DEFAULT             (_VEQ_FIFOOUT_CNT_DEFAULT << 16)            /**< Shifted mode DEFAULT for VEQ_FIFOOUT        */
#define _VEQ_FIFOOUT_ALARM_SHIFT            24                                          /**< Shift value for VEQ_ALARM                   */
#define _VEQ_FIFOOUT_ALARM_MASK             0x1F000000UL                                /**< Bit mask for VEQ_ALARM                      */
#define _VEQ_FIFOOUT_ALARM_DEFAULT          0x00000000UL                                /**< Mode DEFAULT for VEQ_FIFOOUT                */
#define VEQ_FIFOOUT_ALARM_DEFAULT           (_VEQ_FIFOOUT_ALARM_DEFAULT << 24)          /**< Shifted mode DEFAULT for VEQ_FIFOOUT        */

/* Bit fields for VEQ FMTOUT */
#define _VEQ_FMTOUT_RESETVALUE              0x00000000UL                                /**< Default value for VEQ_FMTOUT                */
#define _VEQ_FMTOUT_MASK                    0x0000001FUL                                /**< Mask for VEQ_FMTOUT                         */
#define _VEQ_FMTOUT_ELEMSIZE_SHIFT          0                                           /**< Shift value for VEQ_ELEMSIZE                */
#define _VEQ_FMTOUT_ELEMSIZE_MASK           0x1FUL                                      /**< Bit mask for VEQ_ELEMSIZE                   */
#define _VEQ_FMTOUT_ELEMSIZE_DEFAULT        0x00000000UL                                /**< Mode DEFAULT for VEQ_FMTOUT                 */
#define VEQ_FMTOUT_ELEMSIZE_DEFAULT         (_VEQ_FMTOUT_ELEMSIZE_DEFAULT << 0)         /**< Shifted mode DEFAULT for VEQ_FMTOUT         */

/* Bit fields for VEQ CFG */
#define _VEQ_CFG_RESETVALUE                 0x00203040UL                                /**< Default value for VEQ_CFG                   */
#define _VEQ_CFG_MASK                       0x877F7F7FUL                                /**< Mask for VEQ_CFG                            */
#define _VEQ_CFG_VITERBIKSI1_SHIFT          0                                           /**< Shift value for VEQ_VITERBIKSI1             */
#define _VEQ_CFG_VITERBIKSI1_MASK           0x7FUL                                      /**< Bit mask for VEQ_VITERBIKSI1                */
#define _VEQ_CFG_VITERBIKSI1_DEFAULT        0x00000040UL                                /**< Mode DEFAULT for VEQ_CFG                    */
#define VEQ_CFG_VITERBIKSI1_DEFAULT         (_VEQ_CFG_VITERBIKSI1_DEFAULT << 0)         /**< Shifted mode DEFAULT for VEQ_CFG            */
#define _VEQ_CFG_VITERBIKSI2_SHIFT          8                                           /**< Shift value for VEQ_VITERBIKSI2             */
#define _VEQ_CFG_VITERBIKSI2_MASK           0x7F00UL                                    /**< Bit mask for VEQ_VITERBIKSI2                */
#define _VEQ_CFG_VITERBIKSI2_DEFAULT        0x00000030UL                                /**< Mode DEFAULT for VEQ_CFG                    */
#define VEQ_CFG_VITERBIKSI2_DEFAULT         (_VEQ_CFG_VITERBIKSI2_DEFAULT << 8)         /**< Shifted mode DEFAULT for VEQ_CFG            */
#define _VEQ_CFG_VITERBIKSI3_SHIFT          16                                          /**< Shift value for VEQ_VITERBIKSI3             */
#define _VEQ_CFG_VITERBIKSI3_MASK           0x7F0000UL                                  /**< Bit mask for VEQ_VITERBIKSI3                */
#define _VEQ_CFG_VITERBIKSI3_DEFAULT        0x00000020UL                                /**< Mode DEFAULT for VEQ_CFG                    */
#define VEQ_CFG_VITERBIKSI3_DEFAULT         (_VEQ_CFG_VITERBIKSI3_DEFAULT << 16)        /**< Shifted mode DEFAULT for VEQ_CFG            */
#define _VEQ_CFG_SDSCALE_SHIFT              24                                          /**< Shift value for VEQ_SDSCALE                 */
#define _VEQ_CFG_SDSCALE_MASK               0x7000000UL                                 /**< Bit mask for VEQ_SDSCALE                    */
#define _VEQ_CFG_SDSCALE_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for VEQ_CFG                    */
#define VEQ_CFG_SDSCALE_DEFAULT             (_VEQ_CFG_SDSCALE_DEFAULT << 24)            /**< Shifted mode DEFAULT for VEQ_CFG            */
#define VEQ_CFG_SOFTD                       (0x1UL << 31)                               /**< SOFT DECISION                               */
#define _VEQ_CFG_SOFTD_SHIFT                31                                          /**< Shift value for VEQ_SOFTD                   */
#define _VEQ_CFG_SOFTD_MASK                 0x80000000UL                                /**< Bit mask for VEQ_SOFTD                      */
#define _VEQ_CFG_SOFTD_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for VEQ_CFG                    */
#define VEQ_CFG_SOFTD_DEFAULT               (_VEQ_CFG_SOFTD_DEFAULT << 31)              /**< Shifted mode DEFAULT for VEQ_CFG            */

