SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_veq.h
/* Bit fields for VEQ STAT */
#define _VEQ_STAT_RESETVALUE                0x00000000UL                                /**< Default value for VEQ_STAT                  */
#define _VEQ_STAT_MASK                      0x00000001UL                                /**< Mask for VEQ_STAT                           */
#define VEQ_STAT_INITDONE                   (0x1UL << 0)                                /**< Initialization Done                         */
#define _VEQ_STAT_INITDONE_SHIFT            0                                           /**< Shift value for VEQ_INITDONE                */
#define _VEQ_STAT_INITDONE_MASK             0x1UL                                       /**< Bit mask for VEQ_INITDONE                   */
#define _VEQ_STAT_INITDONE_DEFAULT          0x00000000UL                                /**< Mode DEFAULT for VEQ_STAT                   */
#define VEQ_STAT_INITDONE_DEFAULT           (_VEQ_STAT_INITDONE_DEFAULT << 0)           /**< Shifted mode DEFAULT for VEQ_STAT           */

/* Bit fields for VEQ CTRL */
#define _VEQ_CTRL_RESETVALUE                0x00000000UL                                /**< Default value for VEQ_CTRL                  */
#define _VEQ_CTRL_MASK                      0x0000FFFFUL                                /**< Mask for VEQ_CTRL                           */
#define _VEQ_CTRL_FRAMECNT_SHIFT            0                                           /**< Shift value for VEQ_FRAMECNT                */
#define _VEQ_CTRL_FRAMECNT_MASK             0xFFFFUL                                    /**< Bit mask for VEQ_FRAMECNT                   */
#define _VEQ_CTRL_FRAMECNT_DEFAULT          0x00000000UL                                /**< Mode DEFAULT for VEQ_CTRL                   */
#define VEQ_CTRL_FRAMECNT_DEFAULT           (_VEQ_CTRL_FRAMECNT_DEFAULT << 0)           /**< Shifted mode DEFAULT for VEQ_CTRL           */

/** @} End of group EFR32FG25_VEQ_BitFields */
/** @} End of group EFR32FG25_VEQ */
/** @} End of group Parts */

#endif /* EFR32FG25_VEQ_H */
